Parker4091/rs_cmake_stm32/ThirdParty/stm32_hal/mock/mock_stm32_hal_driver.cpp
/// @brief Mock for HalSys
#include "mock_stm32_hal_driver.h"

#include <cmock/cmock.h>

MockSTM32HAL::MockSTM32HAL()  = default;
MockSTM32HAL::~MockSTM32HAL() = default;

// CRC
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_CRC_Init, ( CRC_HandleTypeDef * hcrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_CRC_DeInit, ( CRC_HandleTypeDef * hcrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_CRC_MspInit, ( CRC_HandleTypeDef * hcrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_CRC_MspDeInit, ( CRC_HandleTypeDef * hcrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_CRC_Accumulate, ( CRC_HandleTypeDef * hcrc, uint32_t pBuffer[], uint32_t BufferLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_CRC_Calculate, ( CRC_HandleTypeDef * hcrc, uint32_t pBuffer[], uint32_t BufferLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_CRC_StateTypeDef, HAL_CRC_GetState, ( CRC_HandleTypeDef * hcrc ) );

// HAL System and Overall definitions
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_Init, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_DeInit, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_MspInit, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_MspDeInit, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_InitTick, ( uint32_t TickPriority ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_IncTick, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_Delay, ( uint32_t Delay ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetTick, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetTickPrio, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_SetTickFreq, ( HAL_TickFreqTypeDef Freq ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TickFreqTypeDef, HAL_GetTickFreq, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SuspendTick, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_ResumeTick, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetHalVersion, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetREVID, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetDEVID, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetUIDw0, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetUIDw1, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_GetUIDw2, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_EnableDBGSleepMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_DisableDBGSleepMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_EnableDBGStopMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_DisableDBGStopMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_EnableDBGStandbyMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_DBGMCU_DisableDBGStandbyMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_SRAM2Erase, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_EnableMemorySwappingBank, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_DisableMemorySwappingBank, () );
#if defined( VREFBUF )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_VREFBUF_VoltageScalingConfig, ( uint32_t VoltageScaling ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_VREFBUF_HighImpedanceConfig, ( uint32_t Mode ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_VREFBUF_TrimmingConfig, ( uint32_t TrimmingValue ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_SYSCFG_EnableVREFBUF, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_DisableVREFBUF, () );
#endif /* VREFBUF */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_EnableIOAnalogSwitchBooster, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_SYSCFG_DisableIOAnalogSwitchBooster, () );

// FLASH
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_Program, ( uint32_t TypeProgram, uint32_t Address, uint64_t Data ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_Program_IT, ( uint32_t TypeProgram, uint32_t Address, uint64_t Data ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_FLASH_IRQHandler, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_FLASH_EndOfOperationCallback, ( uint32_t ReturnValue ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_FLASH_OperationErrorCallback, ( uint32_t ReturnValue ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_Unlock, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_Lock, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_OB_Unlock, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_OB_Lock, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASH_OB_Launch, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_FLASH_GetError, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, FLASH_WaitForLastOperation, ( uint32_t Timeout ) );

// Flash EX
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASHEx_Erase, ( FLASH_EraseInitTypeDef * pEraseInit, uint32_t *PageError ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASHEx_Erase_IT, ( FLASH_EraseInitTypeDef * pEraseInit ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASHEx_OBProgram, ( FLASH_OBProgramInitTypeDef * pOBInit ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_FLASHEx_OBGetConfig, ( FLASH_OBProgramInitTypeDef * pOBInit ) );
#if defined( FLASH_CFGR_LVEN )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_FLASHEx_ConfigLVEPin, ( uint32_t ConfigLVE ) );
#endif /* FLASH_CFGR_LVEN */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, FLASH_PageErase, ( uint32_t Page, uint32_t Banks ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, FLASH_FlushCaches, () );

// GPIO
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_Init, ( GPIO_TypeDef * GPIOx, GPIO_InitTypeDef *GPIO_Init ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_DeInit, ( GPIO_TypeDef * GPIOx, uint32_t GPIO_Pin ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, GPIO_PinState, HAL_GPIO_ReadPin, ( GPIO_TypeDef * GPIOx, uint16_t GPIO_Pin ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_WritePin, ( GPIO_TypeDef * GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_TogglePin, ( GPIO_TypeDef * GPIOx, uint16_t GPIO_Pin ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_GPIO_LockPin, ( GPIO_TypeDef * GPIOx, uint16_t GPIO_Pin ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_EXTI_IRQHandler, ( uint16_t GPIO_Pin ) );
// CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_GPIO_EXTI_Callback, ( uint16_t GPIO_Pin ) ); // smodi: Disabled because app is overloading the weak definition

