Parker4091/rs_cmake_stm32/ThirdParty/stm32_hal/mock/mock_stm32_hal_driver.cpp
// IWDG
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_IWDG_Init, ( IWDG_HandleTypeDef * hiwdg ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_IWDG_Refresh, ( IWDG_HandleTypeDef * hiwdg ) );

// Peripheral Control functions
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_PWREx_GetVoltageRange, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_ControlVoltageScaling, ( uint32_t VoltageScaling ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableBatteryCharging, ( uint32_t ResistorSelection ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableBatteryCharging, () );
#if defined( PWR_CR2_USV )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableVddUSB, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableVddUSB, () );
#endif /* PWR_CR2_USV */
#if defined( PWR_CR2_IOSV )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableVddIO2, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableVddIO2, () );
#endif /* PWR_CR2_IOSV */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableInternalWakeUpLine, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableInternalWakeUpLine, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_EnableGPIOPullUp, ( uint32_t GPIO, uint32_t GPIONumber ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_DisableGPIOPullUp, ( uint32_t GPIO, uint32_t GPIONumber ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_EnableGPIOPullDown, ( uint32_t GPIO, uint32_t GPIONumber ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_DisableGPIOPullDown, ( uint32_t GPIO, uint32_t GPIONumber ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnablePullUpPullDownConfig, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisablePullUpPullDownConfig, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableSRAM2ContentRetention, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableSRAM2ContentRetention, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_SetSRAM2ContentRetention, ( uint32_t SRAM2Size ) );
#if defined( PWR_CR1_RRSTP )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableSRAM3ContentRetention, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableSRAM3ContentRetention, () );
#endif /* PWR_CR1_RRSTP */
#if defined( PWR_CR3_DSIPDEN )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableDSIPinsPDActivation, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableDSIPinsPDActivation, () );
#endif /* PWR_CR3_DSIPDEN */
#if defined( PWR_CR2_PVME1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnablePVM1, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisablePVM1, () );
#endif /* PWR_CR2_PVME1 */
#if defined( PWR_CR2_PVME2 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnablePVM2, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisablePVM2, () );
#endif /* PWR_CR2_PVME2 */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnablePVM3, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisablePVM3, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnablePVM4, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisablePVM4, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_ConfigPVM, ( PWR_PVMTypeDef * sConfigPVM ) );
#if defined( PWR_CR3_ENULP )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableBORPVD_ULP, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableBORPVD_ULP, () );
#endif /* PWR_CR3_ENULP */
#if defined( PWR_CR4_EXT_SMPS_ON )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableExtSMPS_0V95, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_DisableExtSMPS_0V95, () );
#endif /* PWR_CR4_EXT_SMPS_ON */

/* Low Power modes configuration functions ************************************/
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnableLowPowerRunMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_PWREx_DisableLowPowerRunMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnterSTOP0Mode, ( uint8_t STOPEntry ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnterSTOP1Mode, ( uint8_t STOPEntry ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnterSTOP2Mode, ( uint8_t STOPEntry ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_EnterSHUTDOWNMode, () );

CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_PVD_PVM_IRQHandler, () );
#if defined( PWR_CR2_PVME1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_PVM1Callback, () );
#endif /* PWR_CR2_PVME1 */
#if defined( PWR_CR2_PVME2 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_PVM2Callback, () );
#endif /* PWR_CR2_PVME2 */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_PVM3Callback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_PWREx_PVM4Callback, () );

// RCC
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCC_DeInit, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCC_OscConfig, ( RCC_OscInitTypeDef * RCC_OscInitStruct ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCC_ClockConfig, ( RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t FLatency ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_MCOConfig, ( uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_EnableCSS, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCC_GetSysClockFreq, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCC_GetHCLKFreq, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCC_GetPCLK1Freq, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCC_GetPCLK2Freq, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_GetOscConfig, ( RCC_OscInitTypeDef * RCC_OscInitStruct ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_GetClockConfig, ( RCC_ClkInitTypeDef * RCC_ClkInitStruct, uint32_t *pFLatency ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_NMI_IRQHandler, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCC_CSSCallback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCC_GetResetSource, () );

// RCC Extentsion
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCCEx_PeriphCLKConfig, ( RCC_PeriphCLKInitTypeDef * PeriphClkInit ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_GetPeriphCLKConfig, ( RCC_PeriphCLKInitTypeDef * PeriphClkInit ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCCEx_GetPeriphCLKFreq, ( uint32_t PeriphClk ) );
#if defined( RCC_PLLSAI1_SUPPORT )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCCEx_EnablePLLSAI1, ( RCC_PLLSAI1InitTypeDef * PLLSAI1Init ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCCEx_DisablePLLSAI1, () );
#endif /* RCC_PLLSAI1_SUPPORT */
#if defined( RCC_PLLSAI2_SUPPORT )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCCEx_EnablePLLSAI2, ( RCC_PLLSAI2InitTypeDef * PLLSAI2Init ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_RCCEx_DisablePLLSAI2, () );
#endif /* RCC_PLLSAI2_SUPPORT */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_WakeUpStopCLKConfig, ( uint32_t WakeUpClk ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_StandbyMSIRangeConfig, ( uint32_t MSIRange ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_EnableLSECSS, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_DisableLSECSS, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_EnableLSECSS_IT, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_LSECSS_IRQHandler, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_LSECSS_Callback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_EnableLSCO, ( uint32_t LSCOSource ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_DisableLSCO, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_EnableMSIPLLMode, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_DisableMSIPLLMode, () );
#if defined( OCTOSPI1 ) && defined( OCTOSPI2 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_OCTOSPIDelayConfig, ( uint32_t Delay1, uint32_t Delay2 ) );
#endif /* OCTOSPI1 && OCTOSPI2 */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRSConfig, ( RCC_CRSInitTypeDef * pInit ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRSSoftwareSynchronizationGenerate, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRSGetSynchronizationInfo, ( RCC_CRSSynchroInfoTypeDef * pSynchroInfo ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_RCCEx_CRSWaitSynchronization, ( uint32_t Timeout ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRS_IRQHandler, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRS_SyncOkCallback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRS_SyncWarnCallback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRS_ExpectedSyncCallback, () );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_RCCEx_CRS_ErrorCallback, ( uint32_t Error ) );

// Timer
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Init, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_Base_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_Base_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Start, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Stop, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Start_IT, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Stop_IT, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Start_DMA, ( TIM_HandleTypeDef * htim, const uint32_t *pData, uint16_t Length ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Base_Stop_DMA, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Init, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_OC_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_OC_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Start_DMA,
                     ( TIM_HandleTypeDef * htim, uint32_t Channel, const uint32_t *pData, uint16_t Length ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Init, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PWM_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PWM_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Start_DMA,
                     ( TIM_HandleTypeDef * htim, uint32_t Channel, const uint32_t *pData, uint16_t Length ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Init, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_IC_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_IC_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Start_DMA,
                     ( TIM_HandleTypeDef * htim, uint32_t Channel, uint32_t *pData, uint16_t Length ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_Init, ( TIM_HandleTypeDef * htim, uint32_t OnePulseMode ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_OnePulse_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_OnePulse_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_Start, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_Stop, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t OutputChannel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Init, ( TIM_HandleTypeDef * htim, TIM_Encoder_InitTypeDef *sConfig ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_DeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_Encoder_MspInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_Encoder_MspDeInit, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Start, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Stop, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Start_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Stop_IT, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Start_DMA,
                     ( TIM_HandleTypeDef * htim, uint32_t Channel, uint32_t *pData1, uint32_t *pData2, uint16_t Length ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_Encoder_Stop_DMA, ( TIM_HandleTypeDef * htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_IRQHandler, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OC_ConfigChannel,
                     ( TIM_HandleTypeDef * htim, const TIM_OC_InitTypeDef *sConfig, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_PWM_ConfigChannel,
                     ( TIM_HandleTypeDef * htim, const TIM_OC_InitTypeDef *sConfig, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_IC_ConfigChannel,
                     ( TIM_HandleTypeDef * htim, const TIM_IC_InitTypeDef *sConfig, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_OnePulse_ConfigChannel,
                     ( TIM_HandleTypeDef * htim, TIM_OnePulse_InitTypeDef *sConfig, uint32_t OutputChannel, uint32_t InputChannel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_ConfigOCrefClear,
                     ( TIM_HandleTypeDef * htim, const TIM_ClearInputConfigTypeDef *sClearInputConfig, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_ConfigClockSource,
                     ( TIM_HandleTypeDef * htim, const TIM_ClockConfigTypeDef *sClockSourceConfig ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_ConfigTI1Input, ( TIM_HandleTypeDef * htim, uint32_t TI1_Selection ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_SlaveConfigSynchro,
                     ( TIM_HandleTypeDef * htim, const TIM_SlaveConfigTypeDef *sSlaveConfig ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_SlaveConfigSynchro_IT,
                     ( TIM_HandleTypeDef * htim, const TIM_SlaveConfigTypeDef *sSlaveConfig ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_WriteStart,
                     ( TIM_HandleTypeDef * htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t *BurstBuffer,
                       uint32_t BurstLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_MultiWriteStart,
                     ( TIM_HandleTypeDef * htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t *BurstBuffer,
                       uint32_t BurstLength, uint32_t DataLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_WriteStop, ( TIM_HandleTypeDef * htim, uint32_t BurstRequestSrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_ReadStart,
                     ( TIM_HandleTypeDef * htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t *BurstBuffer, uint32_t BurstLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_MultiReadStart,
                     ( TIM_HandleTypeDef * htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t *BurstBuffer, uint32_t BurstLength,
                       uint32_t DataLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_DMABurst_ReadStop, ( TIM_HandleTypeDef * htim, uint32_t BurstRequestSrc ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_GenerateEvent, ( TIM_HandleTypeDef * htim, uint32_t EventSource ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_TIM_ReadCapturedValue, ( const TIM_HandleTypeDef *htim, uint32_t Channel ) );
// CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PeriodElapsedCallback, ( TIM_HandleTypeDef * htim ) ); // TODO(smodi): This is a __weak function in the HAL - need to figure out  how to do a weak mock
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PeriodElapsedHalfCpltCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_OC_DelayElapsedCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_IC_CaptureCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_IC_CaptureHalfCpltCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PWM_PulseFinishedCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_PWM_PulseFinishedHalfCpltCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_TriggerCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_TriggerHalfCpltCallback, ( TIM_HandleTypeDef * htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_TIM_ErrorCallback, ( TIM_HandleTypeDef * htim ) );
#if( USE_HAL_TIM_REGISTER_CALLBACKS == 1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_RegisterCallback,
                     ( TIM_HandleTypeDef * htim, HAL_TIM_CallbackIDTypeDef CallbackID, pTIM_CallbackTypeDef pCallback ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_TIM_UnRegisterCallback,
                     ( TIM_HandleTypeDef * htim, HAL_TIM_CallbackIDTypeDef CallbackID ) );
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_Base_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_OC_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_PWM_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_IC_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_OnePulse_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_StateTypeDef, HAL_TIM_Encoder_GetState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_ActiveChannel, HAL_TIM_GetActiveChannel, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_ChannelStateTypeDef, HAL_TIM_GetChannelState, ( const TIM_HandleTypeDef *htim, uint32_t Channel ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_TIM_DMABurstStateTypeDef, HAL_TIM_DMABurstState, ( const TIM_HandleTypeDef *htim ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_Base_SetConfig, ( TIM_TypeDef * TIMx, const TIM_Base_InitTypeDef *Structure ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_TI1_SetConfig,
                     ( TIM_TypeDef * TIMx, uint32_t TIM_ICPolarity, uint32_t TIM_ICSelection, uint32_t TIM_ICFilter ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_OC2_SetConfig, ( TIM_TypeDef * TIMx, const TIM_OC_InitTypeDef *OC_Config ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_ETR_SetConfig,
                     ( TIM_TypeDef * TIMx, uint32_t TIM_ExtTRGPrescaler, uint32_t TIM_ExtTRGPolarity, uint32_t ExtTRGFilter ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_DMADelayPulseHalfCplt, ( DMA_HandleTypeDef * hdma ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_DMAError, ( DMA_HandleTypeDef * hdma ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_DMACaptureCplt, ( DMA_HandleTypeDef * hdma ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_DMACaptureHalfCplt, ( DMA_HandleTypeDef * hdma ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_CCxChannelCmd, ( TIM_TypeDef * TIMx, uint32_t Channel, uint32_t ChannelState ) );
#if( USE_HAL_TIM_REGISTER_CALLBACKS == 1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, TIM_ResetCallback, ( TIM_HandleTypeDef * htim ) );
#endif /* USE_HAL_TIM_REGISTER_CALLBACKS */

