Parker4091/rs_cmake_stm32/ThirdParty/stm32_hal/mock/mock_stm32_hal_driver.cpp
// UART
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Init, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_HalfDuplex_Init, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_LIN_Init, ( UART_HandleTypeDef * huart, uint32_t BreakDetectLength ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_MultiProcessor_Init,
                     ( UART_HandleTypeDef * huart, uint8_t Address, uint32_t WakeUpMethod ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_DeInit, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_MspInit, ( UART_HandleTypeDef * huart ) );
//CMOCK_MOCK_FUNCTION(MockSTM32HAL,void, HAL_UART_MspDeInit,(UART_HandleTypeDef *huart));
#if( USE_HAL_UART_REGISTER_CALLBACKS == 1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_RegisterCallback,
                     ( UART_HandleTypeDef * huart, HAL_UART_CallbackIDTypeDef CallbackID, pUART_CallbackTypeDef pCallback ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_UnRegisterCallback,
                     ( UART_HandleTypeDef * huart, HAL_UART_CallbackIDTypeDef CallbackID ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_RegisterRxEventCallback,
                     ( UART_HandleTypeDef * huart, pUART_RxEventCallbackTypeDef pCallback ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_UnRegisterRxEventCallback, ( UART_HandleTypeDef * huart ) );
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Transmit,
                     ( UART_HandleTypeDef * huart, const uint8_t *pData, uint16_t Size, uint32_t Timeout ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Receive,
                     ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size, uint32_t Timeout ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Transmit_IT, ( UART_HandleTypeDef * huart, const uint8_t *pData, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Receive_IT, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Transmit_DMA, ( UART_HandleTypeDef * huart, const uint8_t *pData, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Receive_DMA, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_DMAPause, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_DMAResume, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_DMAStop, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Abort, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_AbortTransmit, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_AbortReceive, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_Abort_IT, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_AbortTransmit_IT, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_AbortReceive_IT, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_IRQHandler, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_TxHalfCpltCallback, ( UART_HandleTypeDef * huart ) );
//CMOCK_MOCK_FUNCTION(MockSTM32HAL,void, HAL_UART_TxCpltCallback,(UART_HandleTypeDef *huart));
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_RxHalfCpltCallback, ( UART_HandleTypeDef * huart ) );
//CMOCK_MOCK_FUNCTION(MockSTM32HAL,void, HAL_UART_RxCpltCallback,(UART_HandleTypeDef *huart));
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_ErrorCallback, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_AbortCpltCallback, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_AbortTransmitCpltCallback, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_AbortReceiveCpltCallback, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UARTEx_RxEventCallback, ( UART_HandleTypeDef * huart, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_UART_ReceiverTimeout_Config, ( UART_HandleTypeDef * huart, uint32_t TimeoutValue ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_EnableReceiverTimeout, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_UART_DisableReceiverTimeout, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_LIN_SendBreak, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_MultiProcessor_EnableMuteMode, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_MultiProcessor_DisableMuteMode, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, HAL_MultiProcessor_EnterMuteMode, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_HalfDuplex_EnableTransmitter, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, HAL_HalfDuplex_EnableReceiver, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_UART_StateTypeDef, HAL_UART_GetState, ( const UART_HandleTypeDef *huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, uint32_t, HAL_UART_GetError, ( const UART_HandleTypeDef *huart ) );
#if( USE_HAL_UART_REGISTER_CALLBACKS == 1 )
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, UART_InitCallbacksToDefault, ( UART_HandleTypeDef * huart ) );
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, UART_SetConfig, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, UART_CheckIdleState, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, UART_WaitOnFlagUntilTimeout,
                     ( UART_HandleTypeDef * huart, uint32_t Flag, FlagStatus Status, uint32_t Tickstart, uint32_t Timeout ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, void, UART_AdvFeatureConfig, ( UART_HandleTypeDef * huart ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, UART_Start_Receive_IT, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) );
CMOCK_MOCK_FUNCTION( MockSTM32HAL, HAL_StatusTypeDef, UART_Start_Receive_DMA, ( UART_HandleTypeDef * huart, uint8_t *pData, uint16_t Size ) );

